// First find the device by serial from your inventory table
let DeviceSerialToAAD =
    IntuneDevices
    | where SerialNumber =~ "YOUR-SERIAL-HERE"
    | project AADDeviceId = tostring(AzureADDeviceId), SerialNumber;
// Then see if that device has appeared in Entra sign-ins
SigninLogs
| join kind=inner DeviceSerialToAAD on $left.DeviceId == $right.AADDeviceId
| project TimeGenerated, UserPrincipalName, AppDisplayName, IPAddress, DeviceId, SerialNumber
| order by TimeGenerated desc



IntuneDevices
| where isnotempty(SerialNumber)
| where SerialNumber =~ "YOUR-SERIAL-HERE"


DeviceInfo
| where isnotempty(DeviceSerialNumber)
| where DeviceSerialNumber =~ "YOUR-SERIAL-HERE"

AzureActivity
| where ResourceId contains "<resource-id>"
| where ActivityStatus == "Succeeded"
| project TimeGenerated, Caller
| sort by TimeGenerated asc


let start_time = ago(30d);  // change this to your desired window
let end_time = now();
Heartbeat
| where TimeGenerated between (start_time .. end_time)
| summarize HeartbeatCount=count() by Computer
| extend TotalHours = datetime_diff('hour', end_time, start_time)
| extend AvailableHours = HeartbeatCount * 1m / 60  // if heartbeat every 1 min
| extend UptimePercent = round(AvailableHours * 100.0 / TotalHours, 2)
| project Computer, AvailableHours, TotalHours, UptimePercent
